app/views/articles/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 13]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 13]]
---
                                        <div class="col-xs-2">
                                                <% if article.comments.empty? %>

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 13]]
---
                                                        <button class="btn btn-sm btn-primary" type="button" data-toggle="collapse" data-target="#collapseExample<%= article.id %>" aria-expanded="false" aria-controls="collapseExample">
                                                                Comments: (<%= article.comments.size %>)