app/views/articles/show.html.erb


                        <% if @article.comments.empty? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 36]]
SELECT 1 AS one FROM "comments" WHERE "comments"."article_id" = ? LIMIT ?  [["article_id", 36], ["LIMIT", 1]]

                                <button class="btn btn-sm btn-primary" type="button" data-toggle="collapse" data-target="#collapseExample<%= @article.id %>" aria-expanded="false" aria-controls="collapseExample">
                                        Comments: (<%= @article.comments.size %>)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 36]]

                                <div class="card card-body" style="background-color: #dce6de">
                                        <% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 36]]