app/views/shared/_article.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 18]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 22]]
---

                                        <% if element.comments.empty? %>

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 18]]
---
                                                        >
                                                                Comments <span class="badge badge-pill badge-light"><%= element.comments.size %></span>