app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index
		page = params[:page]
		per_page = ENV['article_per_page'].to_i
		@articles = Article.page(page).per(per_page)

INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Amazing article"], ["text", "Incredible content in this article"], ["created_at", "2021-04-18 14:22:58.829331"], ["updated_at", "2021-04-18 14:22:58.829331"], ["user_id", 6]]
---
	def create
		# render - это метод rails отрендерит информацию
		# render plain: params[:article].inspect

		# @article = Article.new(params[:article])
		@article = Article.new(article_params)
		@article.user_id = current_user.id

		if @article.save