app/controllers/comments_controller.rb

        def create
                # тк комментарий - это часть статьи, то и создание комментария будет через @article
                # если посмотреть в маршрутах:
                #POST            /articles/:article_id/comments(.:format)        comments#create
                # поэтому:      params[:article_id]
                @article = Article.find(params[:article_id])

                # @article.comments.create( { author: 'Mike', body: 'Hello! It is Mike!'} )

                # @article.comments.create(comment_params)
                #заменили на:
                comment = @article.comments.new(comment_params)
                comment.author = current_user.username
                comment.user_id = current_user.id

                # TODO: improve (redirect_to twice)
                if comment.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "body", "article_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["author", "Qqqq"], ["body", "One more comment from me ))"], ["article_id", 13], ["created_at", "2021-04-18 14:18:27.187986"], ["updated_at", "2021-04-18 14:18:27.187986"], ["user_id", 6]]

        def edit
                @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]

        def update
                @comment = Comment.find(params[:id])
                @comment.body = comment_params.dig(:body) if comment_params.dig(:body)

                # @comment.save
                if @comment.save
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "When and then !!!!!!! "], ["updated_at", "2021-04-16 13:40:44.607428"], ["id", 31]]

        def destroy
                @comment = Comment.find(params[:id])
                # @comment.body = 'COMMENT IS DELETED'
                if @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 35]]