app/controllers/search_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" IN (?, ?)  [["id", 18], ["id", 22]]
---
        def index
<<<<<<< HEAD
                # add % symbol for SQL-query in content of article's titles and text (the same is for comment's body)
                @search_text = params[:search_query]
                search_query = '%' + @search_text.downcase + '%'

                articles_by_title = Article.where("title LIKE ?", search_query)
                articles_by_text = Article.where("text LIKE ?", search_query)

                articles_by_comment_body = []
                comments = Comment.where('body LIKE ?', search_query)
                comments.each do |comment|
                        article = Article.find(comment.article_id)